import './index.css';
const Checkbox = (props:any) => {

    return (
        <div className="checkbox-wrapper">
            <input type="checkbox" id="hd-1" className="hide"/>
                <label htmlFor="hd-1" ><span>Какие документы необходимо предоставить при поступлении в 2021 году?</span></label>
                <div className="question-text">
                    Для поступления на платную основу необходимо заключить Договор об оказании платных образовательных услуг.
                    Бланк договора подписывается поступающим и заказчиком обучения. Заказчиком обучения является тот, 
                    с чьего счета будет произведена оплата по договору. Если на момент подписания договора поступающему не исполнилось 18 лет, 
                    договор подписывается поступающим, его родителем и заказчиком обучения. Каждая страница договора должна быть завизирована поступающим и заказчиком обучения.
                    <br/><br/>
                    Университет проверяет договор и подписывает со своей стороны. После оплаты указанной 
                    в договоре суммы денежных средств поступающий включается в приказ о зачислении.
                </div>
            <input type="checkbox" id="hd-2" className="hide"/>
            <label htmlFor="hd-2" ><span>Предоставляются ли скидки по оплате за обучение?</span></label>
                <div className="question-text">
                    Для поступления на платную основу необходимо заключить Договор об оказании платных образовательных услуг.
                    Бланк договора подписывается поступающим и заказчиком обучения. Заказчиком обучения является тот, 
                    с чьего счета будет произведена оплата по договору. Если на момент подписания договора поступающему не исполнилось 18 лет, 
                    договор подписывается поступающим, его родителем и заказчиком обучения. Каждая страница договора должна быть завизирована поступающим и заказчиком обучения.
                    <br/><br/>
                    Университет проверяет договор и подписывает со своей стороны. После оплаты указанной 
                    в договоре суммы денежных средств поступающий включается в приказ о зачислении.
                </div>
            <input type="checkbox" id="hd-3" className="hide"/>
            <label htmlFor="hd-3" ><span>Как поступить на платное обучение?</span></label>
                <div className="question-text">
                    Для поступления на платную основу необходимо заключить Договор об оказании платных образовательных услуг.
                    Бланк договора подписывается поступающим и заказчиком обучения. Заказчиком обучения является тот, 
                    с чьего счета будет произведена оплата по договору. Если на момент подписания договора поступающему не исполнилось 18 лет, 
                    договор подписывается поступающим, его родителем и заказчиком обучения. Каждая страница договора должна быть завизирована поступающим и заказчиком обучения.
                    <br/><br/>
                    Университет проверяет договор и подписывает со своей стороны. После оплаты указанной 
                    в договоре суммы денежных средств поступающий включается в приказ о зачислении.
                </div>
            <input type="checkbox" id="hd-4" className="hide"/>
            <label htmlFor="hd-4" ><span>Какие минимальные баллы при поступлении?</span></label>
            <div className="question-text">
                    Для поступления на платную основу необходимо заключить Договор об оказании платных образовательных услуг.
                    Бланк договора подписывается поступающим и заказчиком обучения. Заказчиком обучения является тот, 
                    с чьего счета будет произведена оплата по договору. Если на момент подписания договора поступающему не исполнилось 18 лет, 
                    договор подписывается поступающим, его родителем и заказчиком обучения. Каждая страница договора должна быть завизирована поступающим и заказчиком обучения.
                    <br/><br/>
                    Университет проверяет договор и подписывает со своей стороны. После оплаты указанной 
                    в договоре суммы денежных средств поступающий включается в приказ о зачислении.
                </div>
            <input type="checkbox" id="hd-5" className="hide"/>
            <label htmlFor="hd-5" ><span>Учитывается ли средний балл диплома бакалавра при поступлении в магистратуру при ранжировании поступающих, при условии, что диплом бакалавра не по специальности?</span></label>
            <div className="question-text">
                    Для поступления на платную основу необходимо заключить Договор об оказании платных образовательных услуг.
                    Бланк договора подписывается поступающим и заказчиком обучения. Заказчиком обучения является тот, 
                    с чьего счета будет произведена оплата по договору. Если на момент подписания договора поступающему не исполнилось 18 лет, 
                    договор подписывается поступающим, его родителем и заказчиком обучения. Каждая страница договора должна быть завизирована поступающим и заказчиком обучения.
                    <br/><br/>
                    Университет проверяет договор и подписывает со своей стороны. После оплаты указанной 
                    в договоре суммы денежных средств поступающий включается в приказ о зачислении.
                </div>
                <button className="questions-switch" >Задать вопрос</button>
                

        </div>

            
            

    );
};

export default Checkbox;
